<a href="https://colab.research.google.com/github/daviders98/pythonprojects/blob/master/Data%20Science%203%20-%20Finding%20meaning%20in%20data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Encontrando significado**

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]

GradeList = zip(names,grades)
df = pd.DataFrame(data=GradeList,columns=['Names','Grades'])
df

     Names  Grades
0      Bob      76
1  Jessica      95
2     Mary      77
3     John      78
4      Mel      99

In [ ]:
df['Grades'].count() # number of values

5

In [ ]:

df['Grades'].mean() # arithmetic average

85.0

In [ ]:
df['Grades'].std() # standard deviation

11.067971810589327

In [ ]:

df['Grades'].min() # minimum

76

In [ ]:

df['Grades'].max() # maximum

99

In [ ]:
df['Grades'].quantile(.25) # first quartile

77.0

In [ ]:

df['Grades'].quantile(.5) # second quartile

78.0

In [ ]:
df['Grades'].quantile(.75) # third quartile

95.0

In [ ]:
df['Grades'].median()

78.0

In [ ]:
df['Grades'].mode()

0    76
1    77
2    78
3    95
4    99
dtype: int64

In [ ]:
# computes the variance of the values in a column
df['Grades'].var()

122.5

In [ ]:
df.var()

Grades    122.5
dtype: float64

**Your Turn**
Of course, in our dataset we only have one column. Try creating a
dataframe and computing summary statistics using the dataset in

**Listing 4-6. Starting Dataset**
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

In [ ]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel'] 
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]
info = zip(names,grades,bsdegrees,msdegrees,phddegrees)
df = pd.DataFrame(data=info,columns=['Names','Grades','BS','MS','PhD'])
items = ['Cantidad de datos','Media','Desv. Est.','Min','Max',
         '1er cuartil','2do cuartil','3er cuartil','Mediana','Moda','Varianza']
List = [
df['Grades'].count(),
df['Grades'].mean(),
df['Grades'].std(),
df['Grades'].min(),
df['Grades'].max(),
df['Grades'].quantile(.25),
df['Grades'].quantile(.5),
df['Grades'].quantile(.75),
df['Grades'].median(),
df['Grades'].mode().values,
df['Grades'].var()]
pd.DataFrame(data = zip(items,List),columns=['Estadístico','Resultado'])

          Estadístico             Resultado
0   Cantidad de datos                     5
1               Media                    85
2          Desv. Est.                11.068
3                 Min                    76
4                 Max                    99
5         1er cuartil                    77
6         2do cuartil                    78
7         3er cuartil                    95
8             Mediana                    78
9                Moda  [76, 77, 78, 95, 99]
10           Varianza                 122.5

# **Cálcular estadística sumativa sobre renglones que cumplen con cierto criterio**

In [ ]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bs = [1,1,0,0,1]
ms = [2,1,0,0,0]
phd = [0,1,0,0,0]

GradeList = zip(names,grades,bs,ms,phd)

df = pd.DataFrame(data=GradeList, columns=['Name','Grade','BS','MS','PhD'])
df

      Name  Grade  BS  MS  PhD
0      Bob     76   1   2    0
1  Jessica     95   1   1    1
2     Mary     77   0   0    0
3     John     78   0   0    0
4      Mel     99   1   0    0

In [ ]:
df.loc[df['PhD']==0].count()

Name     4
Grade    4
BS       4
MS       4
PhD      4
dtype: int64

In [ ]:
df.loc[df['PhD']==0]['Grade'].mean()

82.5

**Your Turn**
Using the data from **Listing 4-10**, what is the average grade for people with
master’s degrees?
**Listing 4-10**. Dataset for Exercise
import pandas as pd
names = ['Bob','Jessica','Mary','John',
'Mel','Sam','Cathy','Henry','Lloyd']
grades = [76,95,77,78,99,84,79,100,73]
bs = [1,1,0,0,1,1,1,0,1]
ms = [2,1,0,0,0,1,1,0,0]
phd = [0,1,0,0,0,2,1,0,0]
GradeList = zip(names,grades,bs,ms,phd)
df = pd.DataFrame(data=GradeList,
columns=['Names','Grades','BS','MS','PhD'])
df

In [ ]:
import pandas as pd
names = ['Bob','Jessica','Mary','John', 'Mel','Sam','Cathy','Henry','Lloyd'] 
grades = [76,95,77,78,99,84,79,100,73] 
bs = [1,1,0,0,1,1,1,0,1] 
ms = [2,1,0,0,0,1,1,0,0] 
phd = [0,1,0,0,0,2,1,0,0] 
GradeList = zip(names,grades,bs,ms,phd) 
df = pd.DataFrame(data=GradeList, columns=['Names','Grades','BS','MS','PhD']) 
df.loc[df['MS']>0]['Grades'].mean()

83.5

# **Ordenamiento de datos**

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"

df = pd.read_csv(Location)
df.head()

     fname     lname  ... grade                                   address
0   Marcia      Pugh  ...  82.4   9253 Richardson Road, Matawan, NJ 07747
1   Kadeem  Morrison  ...  78.2          33 Spring Dr., Taunton, MA 02780
2     Nash    Powell  ...  79.3          41 Hill Avenue, Mentor, OH 44060
3  Noelani    Wagner  ...  83.2        8839 Marshall St., Miami, FL 33125
4  Noelani    Cherry  ...  87.4  8304 Charles Rd., Lewis Center, OH 43035

[5 rows x 8 columns]

In [ ]:
df = df.sort_values(by='age', ascending=0)
df.head()

        fname      lname  ... grade                                     address
1000    Hanna     Mooney  ...  88.8  8293 SW. Cedar Swamp Lane, Union, NJ 07083
902    Steven     Graham  ...  95.1               90 Grove St., Camas, WA 98607
818   Colette      Rojas  ...  73.3     17 Pin Oak Street, Villa Park, IL 60181
822     Rinah   Jacobson  ...  80.8      737 Amherst Court, Amsterdam, NY 12010
826     Hayes  Wilkinson  ...  76.0      350 Temple Court, Mason City, IA 50401

[5 rows x 8 columns]

In [ ]:
df = df.sort_values(by=['grade', 'age'],
ascending=[True, True])
df.head()

       fname      lname  ... grade                                        address
664    Alika      Poole  ...  32.0    9282 Purple Finch Lane, Lexington, NC 27292
972   Keegan  Rasmussen  ...  43.0  876 East Pilgrim Street, Chelmsford, MA 01824
1870    Levi    Coleman  ...  55.9      9453 Laurel Street, Jersey City, NJ 07302
1910    Gail     Mcneil  ...  56.1            8409A Spruce St., Fishers, IN 46037
1494   Jenna     Wagner  ...  56.3    8829 Shore Dr., Hopewell Junction, NY 12533

[5 rows x 8 columns]

**Your Turn**
Can you sort the dataframe to order it by name, age, and then grade? ascending

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"

df = pd.read_csv(Location)
df.sort_values(by=['fname','age','grade'],ascending=True)

       fname    lname  ... grade                                          address
435    Aaron  Knowles  ...  88.7            596 Warren Drive, Brunswick, GA 31525
721    Aaron    Salas  ...  86.7         642 Kirkland Rd., Eden Prairie, MN 55347
340    Abbot     Hall  ...  58.9             84 Rock Creek Lane, Durham, NC 27703
1690   Abbot   Kramer  ...  81.0        3 Golden Star Rd., Lake Jackson, TX 77566
1901   Abbot   Kinney  ...  87.5              643 Wakehurst St., Norman, OK 73072
...      ...      ...  ...   ...                                              ...
341      Zia  Ratliff  ...  88.4  654 S. North St., Springfield Gardens, NY 11413
1915     Zoe  Collins  ...  83.7            235 Mechanic St., Amsterdam, NY 12010
510   Zorita   Oliver  ...  93.1              691 Main Ave., Twin Falls, ID 83301
1247  Zorita   Ashley  ...  80.4           362 Jennings Street, Natchez, MS 39120
1447  Zorita   Benson  ...  85.0    64 Lower River Ave., Shepherdsville, KY 40165

[2000 rows x 8 columns]

# **Correlación**

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"

df = pd.read_csv(Location)

df.head()

     fname     lname  ... grade                                   address
0   Marcia      Pugh  ...  82.4   9253 Richardson Road, Matawan, NJ 07747
1   Kadeem  Morrison  ...  78.2          33 Spring Dr., Taunton, MA 02780
2     Nash    Powell  ...  79.3          41 Hill Avenue, Mentor, OH 44060
3  Noelani    Wagner  ...  83.2        8839 Marshall St., Miami, FL 33125
4  Noelani    Cherry  ...  87.4  8304 Charles Rd., Lewis Center, OH 43035

[5 rows x 8 columns]

In [ ]:
df.corr()

               age  exercise     hours     grade
age       1.000000 -0.003643 -0.017467 -0.007580
exercise -0.003643  1.000000  0.021105  0.161286
hours    -0.017467  0.021105  1.000000  0.801955
grade    -0.007580  0.161286  0.801955  1.000000

**Your Turn**
Load the data from the code in **Listing 4-15** and find the correlations.
**Listing 4-15**. Load Data from CSV
import pandas as pd
Location = "datasets/tamiami.csv"

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/tamiami.csv"

df = pd.read_csv(Location)
df.corr()

                                      Cart Location  ...     Price
Cart Location                              1.000000  ... -0.138444
Hot Dog Sales                              0.042705  ... -0.966378
Employees in Nearby Office Buildings      -0.068923  ... -0.881540
Num of Nearby Restaurants                  0.049701  ... -0.933951
Num of Other Food Carts Nearby             0.077219  ...  0.860154
Price                                     -0.138444  ...  1.000000

[6 rows x 6 columns]

# **Regresión**

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"

df = pd.read_csv(Location)
df.head()

     fname     lname  ... grade                                   address
0   Marcia      Pugh  ...  82.4   9253 Richardson Road, Matawan, NJ 07747
1   Kadeem  Morrison  ...  78.2          33 Spring Dr., Taunton, MA 02780
2     Nash    Powell  ...  79.3          41 Hill Avenue, Mentor, OH 44060
3  Noelani    Wagner  ...  83.2        8839 Marshall St., Miami, FL 33125
4  Noelani    Cherry  ...  87.4  8304 Charles Rd., Lewis Center, OH 43035

[5 rows x 8 columns]

In [ ]:
import statsmodels.formula.api as sm

result = sm.ols(formula='grade ~ age + exercise + hours', data=df).fit()
result.summary()

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                  grade   R-squared:                       0.664
Model:                            OLS   Adj. R-squared:                  0.664
Method:                 Least Squares   F-statistic:                     1315.
Date:                Thu, 22 Oct 2020   Prob (F-statistic):               0.00
Time:                        01:27:00   Log-Likelihood:                -6300.7
No. Observations:                2000   AIC:                         1.261e+04
Df Residuals:                    1996   BIC:                         1.263e+04
Df Model:                           3
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept     57.8704      1.321     43.804      0.000      55.279      60.461
age            0.0397      0.075      0.532      0.595      -0.107       0.186
exercise       0.9893      0.089     11.131      0.000       0.815       1.164
hours          1.9165      0.031     61.564      0.000       1.855       1.978
==============================================================================
Omnibus:                      321.187   Durbin-Watson:                   2.047
Prob(Omnibus):                  0.000   Jarque-Bera (JB):             2196.187
Skew:                          -0.567   Prob(JB):                         0.00
Kurtosis:                       8.007   Cond. No.                         213.
==============================================================================

Warnings:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

In [ ]:
import statsmodels.formula.api as sm
result = sm.ols(
formula='grade ~ exercise + hours',
data=df).fit()
result.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                  grade   R-squared:                       0.664
Model:                            OLS   Adj. R-squared:                  0.664
Method:                 Least Squares   F-statistic:                     1973.
Date:                Wed, 28 Oct 2020   Prob (F-statistic):               0.00
Time:                        22:32:01   Log-Likelihood:                -6300.8
No. Observations:                2000   AIC:                         1.261e+04
Df Residuals:                    1997   BIC:                         1.262e+04
Df Model:                           2
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept     58.5316      0.447    130.828      0.000      57.654      59.409
exercise       0.9892      0.089     11.131      0.000       0.815       1.163
hours          1.9162      0.031     61.575      0.000       1.855       1.977
==============================================================================
Omnibus:                      318.721   Durbin-Watson:                   2.048
Prob(Omnibus):                  0.000   Jarque-Bera (JB):             2158.000
Skew:                          -0.564   Prob(JB):                         0.00
Kurtosis:                       7.962   Cond. No.                         43.2
==============================================================================

Warnings:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

**Your Turn**
Create a new column where you convert gender to numeric values, like
1 for female and 0 for male. Can you now add gender to your regression?
Does this improve your R-squared?

In [ ]:
import pandas as pd
import statsmodels.formula.api as sm
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"

df = pd.read_csv(Location)

result = sm.ols(formula='grade ~ age + exercise + hours', data=df).fit()
first = result.rsquared
def gendertonum(x):
  if x=='male':
    return 0
  if x=='female':
    return 1
df['GenderNumeric'] = df['gender'].apply(gendertonum)

second = sm.ols(formula='grade ~ age + exercise + hours + GenderNumeric',data = df).fit()
second = second.rsquared


resultsdf = pd.DataFrame(data=zip([first],[second]), columns=['First','Second'])
resultsdf

#Muy poco pero sí se mejora.

      First    Second
0  0.664029  0.664558

# **Regresión sin intercepto**

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()
result = sm.ols(formula='grade ~ age + exercise + hours - 1', data=df).fit()
result.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                                 OLS Regression Results
=======================================================================================
Dep. Variable:                  grade   R-squared (uncentered):                   0.991
Model:                            OLS   Adj. R-squared (uncentered):              0.991
Method:                 Least Squares   F-statistic:                          7.284e+04
Date:                Sat, 10 Oct 2020   Prob (F-statistic):                        0.00
Time:                        17:17:56   Log-Likelihood:                         -6974.3
No. Observations:                2000   AIC:                                  1.395e+04
Df Residuals:                    1997   BIC:                                  1.397e+04
Df Model:                           3
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
age            3.1129      0.035     88.030      0.000       3.044       3.182
exercise       1.7659      0.122     14.482      0.000       1.527       2.005
hours          2.2860      0.042     54.486      0.000       2.204       2.368
==============================================================================
Omnibus:                      131.221   Durbin-Watson:                   2.006
Prob(Omnibus):                  0.000   Jarque-Bera (JB):              403.367
Skew:                          -0.301   Prob(JB):                     2.57e-88
Kurtosis:                       5.116   Cond. No.                         14.2
==============================================================================

Warnings:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

**Your Turn**
Try running these simple regressions with no intercept: 
1. Tests for the
relationship between just grade and age; 
2. Tests for the relationship
between just grade and exercise; and 
3. Tests for the relationship between
just grade and study.

If you had to pick just one, which one do you like best?

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)

result = sm.ols(formula='grade ~ age  - 1', data=df).fit()

result2 = sm.ols(formula='grade ~ exercise -1',data = df).fit()

result3 = sm.ols(formula='grade ~ hours - 1',data = df).fit()

resultsdf = pd.DataFrame(data=zip([result.rsquared,result.params[0]],
                                  [result2.rsquared,result.params[0]],
                                  [result3.rsquared,result3.params[0]]),
                         columns=['First','Second','Third'])
resultsdf.index = ['R-squared','Coefficient']
resultsdf

#Yo me quedaría con el tercer modelo, esto es debido a que con el primer modelo se cae en 2
#errores, el primero es el sobreajuste (no es recomendable tener R^2 muy altos para cuando se habla de
#variables que no tienen nada que ver), y el segundo error es que está afirmando que existe una alta
#correlación entre la edad y la calificación, donde a mayor edad, se tiene más calificación.
import matplotlib.pyplot as plt 
plt.scatter(df['grade'],df['age'])
#con la gráfica se comprueba que esto no es cierto.
#y la razon por la que no se elije el segundo es porque tiene baja correlación
#además de que no tiene sentido relacionar las horas de ejercicio con sus calificaciones.
#Por otro lado, al momento de relacionar sus horas de estudio con sus calificaciones, esto tiene sentido
#debido a que a mayor horas de estudio, mayor calificacion (el coeficiente es positivo).

                 First     Second     Third
R-squared     0.000057   0.819798  0.929443
Coefficient  83.278229  83.278229  6.840720

# **Tablas dinámicas** (*o Tablas crosstab*)

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

     fname     lname  ... grade                                   address
0   Marcia      Pugh  ...  82.4   9253 Richardson Road, Matawan, NJ 07747
1   Kadeem  Morrison  ...  78.2          33 Spring Dr., Taunton, MA 02780
2     Nash    Powell  ...  79.3          41 Hill Avenue, Mentor, OH 44060
3  Noelani    Wagner  ...  83.2        8839 Marshall St., Miami, FL 33125
4  Noelani    Cherry  ...  87.4  8304 Charles Rd., Lewis Center, OH 43035

[5 rows x 8 columns]

In [ ]:
pd.pivot_table(df, index=['gender'])

           age  exercise    grade   hours
gender
female  16.568     3.047  82.7173  10.932
male    16.589     2.954  82.3948  11.045

In [ ]:
pd.pivot_table(df, values=['grade'], index=['gender'])

          grade
gender
female  82.7173
male    82.3948

In [ ]:
pd.pivot_table(df, values=['grade'], index=['gender'], aggfunc='min')

        grade
gender
female   32.0
male     43.0

In [ ]:
pd.pivot_table(df, index=['gender','age'], aggfunc='max', values=['hours'])

            hours
gender age
female 14      20
       15      20
       16      19
       17      20
       18      20
       19      20
male   14      19
       15      20
       16      20
       17      20
       18      20
       19      20

In [ ]:
pd.pivot_table(df, index=['gender'], aggfunc='mean', values=['grade','hours'])

          grade   hours
gender
female  82.7173  10.932
male    82.3948  11.045

In [ ]:
df2 = df.loc[df['age'] == 17]
pd.pivot_table(df2, index=['gender'], aggfunc='mean', values=['grade','hours'])

            grade      hours
gender
female  83.599435  10.943503
male    82.949721  11.268156

In [ ]:
df2 = df.loc[df['age'] == 17]
pd.pivot_table(df2, index=['gender'], aggfunc='mean', values=['grade','hours'], margins='True')

            grade      hours
gender
female  83.599435  10.943503
male    82.949721  11.268156
All     83.272753  11.106742

**Your Turn**
Can you create a pivot table showing the average grade by gender of
people who had more than two hours of exercise?

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)
df = df.loc[df['exercise']>2]
pd.pivot_table(df,index = ['gender'], aggfunc='mean',values=['grade'])

            grade
gender
female  83.730343
male    83.622542